settings.org
#+TITLE: My Hot and Spicy Emacs config
#+OPTIONS: toc:4 h:4
#+STARTUP: showeverything
#+PROPERTY: header-args:emacs-lisp
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-bigblow.setup
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:http://thomasf.github.io/solarized-css/org-info.min.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />

* Other config files
** AwesomeWM
[[file:~/.config/awesome/rc.org][rc.org]]
[[file:~/.config/awesome/mytheme.org][mytheme.org]]
* Helpers
** Buffer create/switch function generator
From reddit https://www.reddit.com/r/emacs/comments/l4v1ux/one_of_the_most_useful_small_lisp_functions_in_my/
#+begin_src emacs-lisp :results none
(defun make-toggle-function (buffer-name buffer-create-fn &optional switch-cont)
  "Makes a toggle-function to have raise-or-create behaviour.

Creates a toggle-function that executes BUFFER-CREATE-FN if a
buffer named BUFFER-NAME doesn't exist, switches to the buffer
named BUFFER-NAME if it exists, and switches to the previous
buffer if we are currently visiting buffer BUFFER-NAME.

The SWITCH-CONT argument is a function which, if given, is called
after the buffer has been created or switched to.  This allows
running further actions that setup the state of the buffer or
modify it."
  (lambda ()
    (interactive)
    (let ((target-buf (get-buffer buffer-name)))
     (if target-buf
     (if (eq (current-buffer) target-buf)
         (progn
           (message "switching to other buffer")
           (switch-to-buffer nil))
         (progn
           (message "switching back...")
           (switch-to-buffer buffer-name)
           (when switch-cont (funcall switch-cont))))
       (message "creating buffer...")
       (funcall buffer-create-fn)
       (when switch-cont (funcall switch-cont))))))
#+end_src
** Org-Capture server
Opens a server on http://localhost:8080/capture/<keys>/<contents> that calls org-capture on <contents>,
with the template <keys>. Run =M-x httpd-start= to start the server.
#+begin_src emacs-lisp :results none
;; TODO: this causes runtime errors, since defservlet* is a macro!
(after! simple-httpd
    '(defservlet* capture/:keys/:txt text/plain ()
     (org-capture-string txt keys)))
#+end_src
** TODO Extract Haskell package name from Flycheck error
One day, I'll get around to turning this into an attrap fixer. Today is not that day.
#+begin_src emacs-lisp :results none
(defun my/extract-package-name-from-flycheck-error ()
  (interactive)
  (let ((err-at-point (call-interactively #'flycheck-copy-errors-as-kill)))
    (with-temp-buffer
      (insert err-at-point)
      (search-backward-regexp "It is a member of the hidden package")
      (let ((matching-line (thing-at-point 'line)))
        (save-match-data
          (and (string-match "‘\\(.+\\)’" matching-line)
               (kill-new (match-string 1 matching-line))))))))
#+end_src
* The actual config
** Theming
#+begin_src emacs-lisp :results none
(setq doom-theme 'doom-monokai-pro)
#+end_src
** Quality of Life
*** Relative line numbers
Relative line numbers like in vim (shows line number of current line, then relative numbers for the rest)
#+begin_src emacs-lisp :results none
(setq display-line-numbers-type 'relative)
#+end_src
*** Switch focus to newly split windows
#+begin_src emacs-lisp :results none
(defun my/switch-window-then-focus (direction)
    (cond
        ((eq direction 'v) (call-interactively 'evil-window-vsplit))
        ((eq direction 'h) (call-interactively 'evil-window-split))
    )
    (other-window 1))
(defun my/switch-window-then-focus-vertical ()
  (interactive)
  (my/switch-window-then-focus 'v)
)
(defun my/switch-window-then-focus-horizontal ()
  (interactive)
  (my/switch-window-then-focus 'h)
)
(map! :map evil-window-map "v" #'my/switch-window-then-focus-vertical)
(map! :map evil-window-map "s" #'my/switch-window-then-focus-horizontal)
#+end_src
*** Python f-string smart-quote fix
Usually, electric quotes doesn't generate closing quotes for f-strings. This fixes it.
#+begin_src emacs-lisp :results none
(after! python
  (sp-local-pair 'python-mode "f\"" "\"" :trigger "f\""))
#+end_src
*** Alternate leader for non-evil modes
#+begin_src emacs-lisp :results none
(setq doom-leader-key "SPC")
(setq doom-localleader-key "SPC m")
(setq doom-leader-alt-key "M-SPC")
(setq doom-localleader-alt-key "M-SPC m")
#+end_src
*** Disable Evil mode for Calc
It kept overriding keys like k and j, so I'm disabling it.
#+begin_src emacs-lisp :results none
(evil-set-initial-state 'calc-mode 'emacs)
#+end_src
*** Set emacs PATH to match system PATH
#+begin_src emacs-lisp :results none
(when (daemonp)
  (exec-path-from-shell-initialize))
#+end_src
*** Autoscroll Comint buffers
#+begin_src emacs-lisp :results none
(setq comint-scroll-to-bottom-on-output t)
#+end_src
*** Helm
**** Re-add fuzzy matching
#+begin_src emacs-lisp :results none
(setq completion-styles `(basic partial-completion emacs22 initials ,(if (version<= emacs-version "27.0") 'helm-flex 'flex)))
#+end_src
**** Quicker .. mapping
Go up a level with =..= .
#+begin_src emacs-lisp :results none
(after! helm-files
(add-hook 'helm-mode-hook 'key-chord-mode)
(setq key-chord-one-keys-delay 0.02)
(key-chord-define helm-find-files-map ".." #'helm-find-files-up-one-level))
#+end_src
**** Faster REPL command history
#+begin_src emacs-lisp :results none
(map! :map comint-mode-map
      "S-<up>" #'helm-comint-input-ring)
#+end_src
**** Ignore .gitignore'd files
#+begin_src emacs-lisp :results none
(setq helm-ff-skip-git-ignored-files t)
#+end_src
*** Easier error navigation with Alt + arrow keys
#+begin_src emacs-lisp :results none
(map! :map flycheck-mode-map
      "M-<down>" #'flycheck-next-error
      "M-<right>" #'flycheck-next-error
      "M-<up>" #'flycheck-previous-error
      "M-<left>" #'flycheck-previous-error)
#+end_src
*** Open dired in current folder
#+begin_src emacs-lisp :results none
(defun my/dired-here ()
  (interactive)
  (find-file "."))
(map! :leader ">" #'my/dired-here)
#+end_src
*** Add clickable links to Comint shells
#+begin_src emacs-lisp :results none
(add-hook 'compilation-shell-minor-mode 'goto-address-mode)
#+end_src
*** Quicker project creation
#+begin_src emacs-lisp :results none
(defun my/create-lazy-project (filename)
  (interactive "MProject name? ")
    (let ((new-dirname (concat (getenv "HOME") "/Projects/" filename)))
        (make-directory new-dirname)
        (funcall-interactively #'projectile-add-known-project new-dirname)))
(map! :map doom-leader-project-map "n" #'my/create-lazy-project)
#+end_src
*** Open =eww= in side window for more natural =helm-dash=
Credit to https://www.simplify.ba/articles/2016/01/25/display-buffer-alist/
#+begin_src emacs-lisp :results none
(add-to-list 'display-buffer-alist
            `(,"^\\*eww\\*"
                (display-buffer-reuse-window
                display-buffer-in-side-window)
                (reusable-frames     . visible)
                (side                . right)
                (window-height       . 0.45)
                ))
#+end_src
*** =ob-ipython-inspect= niceness
#+begin_src emacs-lisp :results none
(add-to-list 'display-buffer-alist
            `(,"^\\*ob-ipython-inspect\\*"
                (display-buffer-reuse-window
                display-buffer-in-side-window)
                (reusable-frames     . visible)
                (side                . right)
                (window-height       . 0.40)
                ))
(map! :map org-mode-map "C-c ." :desc "Inspect" #'ob-ipython-inspect)
#+end_src

** Org
*** Boilerplate settings
#+begin_src emacs-lisp :results none
(setq org-directory "~/org/")
#+end_src
*** Org sidebar keybind
#+begin_src emacs-lisp :results none
;; (defun my/org-agenda-sidebar ()
;;   (interactive)
;;   (let (())
;;     (call-interactively 'org-sidebar-ql )
;;   )
;; )
(map! :map doom-leader-open-map "o" #'org-sidebar-tree-toggle)
#+end_src
*** (retired) Org Roam bindings
This was added before I learned Doom's org module does, in fact, support Org Roam.
#+begin_src emacs-lisp :results none
;; (defun my/open-todays-file ()
;;   (interactive)
;;   (find-file (expand-file-name (concat org-roam-directory "/" (format-time-string "%Y-%m-%d.org"))))
;; )

;; (map! :map doom-leader-notes-map (:prefix ("r" . "roam")
;;                                   :desc "Find file" "f" #'org-roam-find-file
;;                                   :desc "Open today's file" "r" #'my/open-todays-file
;;                                   ))
#+end_src
*** Reopen PDF where you left off
#+begin_src emacs-lisp :results none
(use-package pdf-view-restore
  :after pdf-tools
  :config
  (add-hook 'pdf-view-mode-hook 'pdf-view-restore-mode))

(setq pdf-view-restore-filename "~/.emacs.d/.pdf-view-restore")
#+end_src
*** Prettiness
Credit to https://zzamboni.org/post/beautifying-org-mode-in-emacs/
#+begin_src emacs-lisp :results none
(setq org-hide-emphasis-markers t)
(add-hook 'org-mode-hook 'org-bullets-mode)
(when (display-graphic-p)
  (let* ((variable-tuple
          (cond ((x-list-fonts "ETBembo")         '(:font "ETBembo"))
                ((x-list-fonts "Source Sans Pro") '(:font "Source Sans Pro"))
                ((x-list-fonts "Lucida Grande")   '(:font "Lucida Grande"))
                ((x-list-fonts "Verdana")         '(:font "Verdana"))
                ((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
                (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro."))))
         (base-font-color     (face-foreground 'default nil 'default))
         (headline           `(:inherit default :weight bold :foreground ,base-font-color)))

    (custom-theme-set-faces
     'user
     `(org-level-8 ((t (,@headline ,@variable-tuple))))
     `(org-level-7 ((t (,@headline ,@variable-tuple))))
     `(org-level-6 ((t (,@headline ,@variable-tuple))))
     `(org-level-5 ((t (,@headline ,@variable-tuple))))
     `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.1))))
     `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.15))))
     `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.25))))
     `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.35))))
     `(org-document-title ((t (,@headline ,@variable-tuple :height 2.0 :underline nil)))))))

#+end_src
** Haskell
