settings.org
** strokes-mode (disabled)
Allows for, among other things, splitting windows with RMB.

Disabled since it was picking up right-clicks as strokes.
#+begin_src emacs-lisp :results none
;; (global-set-key (kbd "<down-mouse-3>") 'strokes-do-stroke)
;; (setq strokes-use-strokes-buffer nil)
#+end_src
** TODO uncategorized
#+begin_src emacs-lisp :results none
(use-package! company
  :config
  (setq company-idle-delay 0)
  (setq company-minimum-prefix-length 1))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((ipython . t)
))

(use-package! company-lsp
  :commands company-lsp)

(use-package! ob-ipython)

(setq lsp-ui-doc-enable nil
      lsp-ui-peek-enable t
      lsp-ui-sideline-enable t
      lsp-ui-imenu-enable t
      lsp-ui-flycheck-enable t)
;;
(put 'narrow-to-region 'disabled nil)

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages (quote (company-lsp company lsp-mode)))
 '(safe-local-variable-values
   (quote
    ((pyvenv-activate . "./env")
     (setenv "GOOGLE_APPLICATION_CREDENTIALS" "polar-standard-246307-5ff6b8064ee7.json")
     (pyenv-activate . "./env")))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
 #+END_SRC

* In progress
** TODO Map creation from anywhere
Ideal workflow: run a command that asks the user for one of the buffer's current maps, then pops up a buffer in =org-mode=
with an emacs-lisp org-babel block prefilled with a =(map! :map <chosen map> )= template. Then I can tweak and adjust it to
my heart's content, hitting =C-c C-c= to test it, and calling org-refile when I'm done to put it in =settings.org= permanently.
#+begin_src emacs-lisp :results none
(setq my/interactive-map-template "* Map for =%s=\n#+begin_src emacs-lisp :results raw\n(defun my/%s-command ()\n\t(interactive)\n\t-- TODO: implement me!\n)\n(map! :map %s my/%s-command)\n#+end_src")
(defun my/interactive-map-open ()
  (interactive)
  (let* ((minor-maps (mapcar #'car minor-mode-map-alist))
         (chosen-map (completing-read "Which map? " (cons (format "%s-map" major-mode) minor-maps))))
    (switch-to-buffer-other-window (make-temp-name (format "*interactive-mapper*" chosen-map)))
    (org-mode)
    (insert (format my/interactive-map-template chosen-map chosen-map chosen-map chosen-map))
    ))
#+end_src
